# Before you start :
   - These exercises are related to the Subsetting and Descriptive Stats lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the `your-code` folder of this lab.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary

In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
import pylab as plt
import warnings
warnings.simplefilter('ignore')

# Challenge 1

#### In this challenge we will use the `Temp_States.csv` file. 

#### First import it into a data frame called `temp`.

In [ ]:
temp = pd.read_csv('Temp_states.csv')

#### Print `temp`

In [ ]:
temp.head()

#### Explore the data types of the Temp dataframe. What type of data do we have? Comment your result.

In [ ]:
temp.info()

There are two types of data:
    1) Object, corresponding to City and State (these are strings)
    2) Float, correpsonding to Temperature which indicates the temperature, therefore, it is a decimal number.

#### Select the rows where state is New York

In [ ]:
temp[temp['State'] == 'New York']

#### What is the average of the temperature of cities in New York?

In [ ]:
temp.groupby('State').mean().Temperature

In [ ]:
temp[temp['State'] == 'New York'].mean().Temperature

#### We want to know cities and states with Temperature above 15 degress Celcius

In [ ]:
temp[temp.Temperature > 15]

#### Now, return only the cities that have a temperature above 15 degress Celcius

In [ ]:
temp[temp['Temperature'] > 15][['City']]

#### We want to know which cities have a temperature above 15 degrees Celcius and below 20 degrees Celcius

*Hint: First write the condition then select the rows.*

In [ ]:
temp[(temp['Temperature'] > 15) & (temp['Temperature'] < 20)]

#### Find the mean and the standard deviation of the temperature of each state.

*Hint: Use functions from Data Manipulation lesson*

In [ ]:
temp.groupby('State').mean().Temperature

In [ ]:
temp.groupby('State').std().Temperature

# Challenge 2

#### Load the `employee.csv` file into a DataFrame. Call the dataframe `employee`

In [ ]:
employee = pd.read_csv('employee.csv')

In [ ]:
employee.columns=[e.lower().replace(' ', '_') for e in employee.columns]

#### Explore the data types of the Temp dataframe. Comment your results

In [ ]:
employee.info()

In [ ]:
employee.head()

This database is showing us information about different persons. With the database name and its content we could deduce that we are seeing the database of the employees of a company with some particular information about each of them: department, education, gender, title, number of years in the company, salary (maybe in thousands of $ or â‚¬?)

#### Show visually the frequency distribution (histogram) of the employee dataset. In few words describe these histograms?

In [ ]:
employee.years.plot.hist(bins=5)

In this case we can see that a big part of the employees leave their jobs during the first two years in the company. Although, once this period is passed, the number of employees leaving the company is reduced until the seventh year, which increases considerably.

In [ ]:
employee.salary.plot.hist(bins=5)

This histogram show us that the salary in this company is between 30 and 70, although we can find a big gap between the lowest salaries and the highest salaries. Although at first sight it might seem that most of the employees have a lower salary, there are more employees in the highest range of salary.

#### What's the average salary in this company?

In [ ]:
employee.salary.mean()

#### What's the highest salary?

In [ ]:
employee.salary.max()

#### What's the lowest salary?

In [ ]:
employee.salary.min()

#### Who are the employees with the lowest salary?

In [ ]:
employee[employee.salary<(np.percentile(employee.salary, 25))][['name','salary']]

#### Could you give all the information about an employee called David?

In [ ]:
employee[employee.name == 'David']

#### Could you give only David's salary?

In [ ]:
employee[employee.name == 'David'][['salary']]

#### Print all the rows where job title is associate

In [ ]:
employee[employee.title == 'associate']

#### Print the first 3 rows of your dataframe

##### Tip : There are 2 ways to do it. Do it both ways

In [ ]:
employee.head()

#### Find the employees who's title is associate and the salary above 55?

In [ ]:
employee[(employee.title == 'associate') & (employee.salary > 55)]

#### Group the employees based on their number of years of employment. What are the average salaries in each group?

In [ ]:
employee.groupby('years').mean().salary

####  What is the average Salary per title?

In [ ]:
employee.groupby('title').mean().salary

#### Show a visual summary of the data using boxplot. What Are the First and Third Quartiles? Comment your results.
##### * Hint : Quantiles vs Quartiles*
##### - `In Probability and Statistics, quantiles are cut points dividing the range of a probability distribution into continuous intervals with equal probabilities. When division is into four parts the values of the variate corresponding to 25%, 50% and 75% of the total distribution are called quartiles.`

In [ ]:
employee.boxplot();

In [ ]:
# print first quartile here

np.percentile(employee.salary, 25)

In [ ]:
np.percentile(employee.years, 25)

In [ ]:
# print third quartile here

np.percentile(employee.salary, 75)

In [ ]:
np.percentile(employee.years, 75)

#### Is the mean salary per gender different?

In [ ]:
employee.groupby('gender').mean().salary

#### Find the minimum, mean and the maximum of all numeric columns for each Department.

##### Hint: Use functions from Data Manipulation lesson

In [ ]:
employee.groupby('department').mean()

In [ ]:
employee2 = employee.copy()

In [ ]:
employee2.groupby('department').min()._get_numeric_data()

In [ ]:
employee2.groupby('department').max()._get_numeric_data()

In [ ]:
employee2.groupby('department').mean()

### Bonus Question

#### For each department, compute the difference between the maximal salary and the minimal salary.

##### * Hint: try using `agg` or `apply` and `lambda`*

In [ ]:
#employee['difference'] = ['maximum']-['minimum']

# Challenge 3

#### Open the Orders.csv dataset. Name your dataset orders

In [3]:
orders = pd.read_csv('Orders/Orders.csv')
orders.columns=[e.lower().replace(' ', '_') for e in orders.columns]

#### Explore your dataset by looking at the data types and the summary statistics. Comment your results

In [4]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397924 entries, 0 to 397923
Data columns (total 14 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   unnamed:_0    397924 non-null  int64
 1   invoiceno     397924 non-null  int64
 2   stockcode     397924 non-null  object
 3   year          397924 non-null  int64
 4   month         397924 non-null  int64
 5   day           397924 non-null  int64
 6   hour          397924 non-null  int64
 7   description   397924 non-null  object
 8   quantity      397924 non-null  int64
 9   invoicedate   397924 non-null  object
 10  unitprice     397924 non-null  float64
 11  customerid    397924 non-null  int64
 12  country       397924 non-null  object
 13  amount_spent  397924 non-null  float64
dtypes: float64(2), int64(8), object(4)
memory usage: 42.5+ MB

In [5]:
orders.describe().T

,count,mean,std,min,25%,50%,75%,max
unnamed:_0,397924.0,278465.221859,152771.368303,0.0,148333.75,284907.50,410079.25,541908.00
invoiceno,397924.0,560617.126645,13106.167695,536365.0,549234.00,561893.00,572090.00,581587.00
year,397924.0,2010.934259,0.247829,2010.0,2011.00,2011.00,2011.00,2011.00
month,397924.0,7.612537,3.416527,1.0,5.00,8.00,11.00,12.00
day,397924.0,3.614555,1.928274,1.0,2.00,3.00,5.00,7.00
hour,397924.0,12.728247,2.273535,6.0,11.00,13.00,14.00,20.00
quantity,397924.0,13.021823,180.420210,1.0,2.00,6.00,12.00,80995.00
unitprice,397924.0,3.116174,22.096788,0.0,1.25,1.95,3.75,8142.75
customerid,397924.0,15294.315171,1713.169877,12346.0,13969.00,15159.00,16795.00,18287.00
amount_spent,397924.0,22.394749,309.055588,0.0,4.68,11.80,19.80,168469.60

In [6]:
orders.head()

,unnamed:_0,invoiceno,stockcode,year,month,day,hour,description,quantity,invoicedate,unitprice,customerid,country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

By the name of the document and the information given in the dataset, we can assume we have a database with all the information of orders and sales made by a store. We can fastly identify a outlier in UnitPrice: the percentile 75 is 3,75â‚¬ but the maximum UnitPrice is 8142â‚¬. This could be either due to a mistake or to a particular item with a higher price that the usual prices in the store.

####  What is the average Purchase Price?

In [7]:
orders.amount_spent.mean()

22.39474850474768

#### What were the highest and lowest purchase prices?

In [8]:
orders.amount_spent.max()

168469.6

In [9]:
orders.amount_spent.min()

0.0

#### Select all the customers we have in Spain

In [10]:
orders[orders.country == 'Spain'].head()

,unnamed:_0,invoiceno,stockcode,year,month,day,hour,description,quantity,invoicedate,unitprice,customerid,country,amount_spent
4250,6421,536944,22383,2010,12,5,12,lunch bag suki design,70,2010-12-03 12:20:00,1.65,12557,Spain,115.5
4251,6422,536944,22384,2010,12,5,12,lunch bag pink polkadot,100,2010-12-03 12:20:00,1.45,12557,Spain,145.0
4252,6423,536944,20727,2010,12,5,12,lunch bag black skull.,60,2010-12-03 12:20:00,1.65,12557,Spain,99.0
4253,6424,536944,20725,2010,12,5,12,lunch bag red retrospot,70,2010-12-03 12:20:00,1.65,12557,Spain,115.5
4254,6425,536944,20728,2010,12,5,12,lunch bag cars blue,100,2010-12-03 12:20:00,1.45,12557,Spain,145.0

#### How many customers do we have in Spain?
##### Hint : Use value_counts()

In [11]:
orders[orders.country == 'Spain'][['customerid']].value_counts().count()

30

#### Select all the customers who have bought more than 50 items ?

In [12]:
orders[orders.quantity > 50][['customerid','quantity']].head()

     customerid  quantity
46        13748        80
83        15291        64
96        14688       120
102       14688        96
174       16029       100

#### Select orders from Spain that are above 50 items

In [13]:
orders[(orders.quantity > 50) & (orders.country == 'Spain')].head()

,unnamed:_0,invoiceno,stockcode,year,month,day,hour,description,quantity,invoicedate,unitprice,customerid,country,amount_spent
4250,6421,536944,22383,2010,12,5,12,lunch bag suki design,70,2010-12-03 12:20:00,1.65,12557,Spain,115.5
4251,6422,536944,22384,2010,12,5,12,lunch bag pink polkadot,100,2010-12-03 12:20:00,1.45,12557,Spain,145.0
4252,6423,536944,20727,2010,12,5,12,lunch bag black skull.,60,2010-12-03 12:20:00,1.65,12557,Spain,99.0
4253,6424,536944,20725,2010,12,5,12,lunch bag red retrospot,70,2010-12-03 12:20:00,1.65,12557,Spain,115.5
4254,6425,536944,20728,2010,12,5,12,lunch bag cars blue,100,2010-12-03 12:20:00,1.45,12557,Spain,145.0

#### Select all free orders

In [14]:
orders[orders.amount_spent == 0].head()

,unnamed:_0,invoiceno,stockcode,year,month,day,hour,description,quantity,invoicedate,unitprice,customerid,country,amount_spent
6914,9302,537197,22841,2010,12,7,14,round cake tin vintage green,1,2010-12-05 14:02:00,0.0,12647,Germany,0.0
22539,33576,539263,22580,2010,12,4,14,advent calendar gingham sack,4,2010-12-16 14:36:00,0.0,16560,United Kingdom,0.0
25379,40089,539722,22423,2010,12,2,13,regency cakestand 3 tier,10,2010-12-21 13:45:00,0.0,14911,EIRE,0.0
29080,47068,540372,22090,2011,1,4,16,paper bunting retrospot,24,2011-01-06 16:41:00,0.0,13081,United Kingdom,0.0
29082,47070,540372,22553,2011,1,4,16,plasters in tin skulls,24,2011-01-06 16:41:00,0.0,13081,United Kingdom,0.0

#### Select all orders that are 'lunch bag'
#### Hint: Use string functions

In [15]:
orders[orders.description.str.contains('lunch bag')].head()

,unnamed:_0,invoiceno,stockcode,year,month,day,hour,description,quantity,invoicedate,unitprice,customerid,country,amount_spent
93,93,536378,20725,2010,12,3,9,lunch bag red retrospot,10,2010-12-01 09:37:00,1.65,14688,United Kingdom,16.50
172,174,536385,22662,2010,12,3,9,lunch bag dolly girl design,10,2010-12-01 09:56:00,1.65,17420,United Kingdom,16.50
354,363,536401,22662,2010,12,3,11,lunch bag dolly girl design,1,2010-12-01 11:21:00,1.65,15862,United Kingdom,1.65
359,368,536401,20725,2010,12,3,11,lunch bag red retrospot,1,2010-12-01 11:21:00,1.65,15862,United Kingdom,1.65
360,369,536401,22382,2010,12,3,11,lunch bag spaceboy design,2,2010-12-01 11:21:00,1.65,15862,United Kingdom,3.30

#### Select all orders that are made in 2011 and are 'lunch bag'

In [16]:
orders[(orders.year == 2011) & (orders.description.str.contains('lunch bag'))].head()

,unnamed:_0,invoiceno,stockcode,year,month,day,hour,description,quantity,invoicedate,unitprice,customerid,country,amount_spent
26340,42678,540015,20725,2011,1,2,11,lunch bag red retrospot,10,2011-01-04 11:40:00,1.65,13319,United Kingdom,16.50
26341,42679,540015,20726,2011,1,2,11,lunch bag woodland,10,2011-01-04 11:40:00,1.65,13319,United Kingdom,16.50
26512,42851,540023,22382,2011,1,2,12,lunch bag spaceboy design,2,2011-01-04 12:58:00,1.65,15039,United Kingdom,3.30
26513,42852,540023,20726,2011,1,2,12,lunch bag woodland,1,2011-01-04 12:58:00,1.65,15039,United Kingdom,1.65
26860,43616,540098,22384,2011,1,2,15,lunch bag pink polkadot,1,2011-01-04 15:50:00,1.65,16241,United Kingdom,1.65

#### Show the frequency distribution of the amount spent in Spain.

In [17]:
orders[orders.country == 'Spain'][['amount_spent']].value_counts()

amount_spent
15.00           186
17.70           122
19.80            99
17.40            86
10.20            76
               ...
17.90             1
16.65             1
14.94             1
14.22             1
17.25             1
Length: 316, dtype: int64

#### Select all orders made in the month of August

In [18]:
orders[orders.month == 8].head()

,unnamed:_0,invoiceno,stockcode,year,month,day,hour,description,quantity,invoicedate,unitprice,customerid,country,amount_spent
199475,285421,561904,22075,2011,8,1,8,6 ribbons elegant christmas,96,2011-08-01 08:30:00,1.45,17941,United Kingdom,139.20
199476,285422,561904,85049E,2011,8,1,8,scandinavian reds ribbons,156,2011-08-01 08:30:00,1.06,17941,United Kingdom,165.36
199477,285423,561905,21385,2011,8,1,9,ivory hanging decoration heart,24,2011-08-01 09:31:00,0.85,14947,United Kingdom,20.40
199478,285424,561905,84970L,2011,8,1,9,single heart zinc t-light holder,12,2011-08-01 09:31:00,0.95,14947,United Kingdom,11.40
199479,285425,561905,84970S,2011,8,1,9,hanging heart zinc t-light holder,12,2011-08-01 09:31:00,0.85,14947,United Kingdom,10.20

#### Select how many orders are made by countries in the month of August
##### Hint: Use value_counts()

In [19]:
orders[orders.month == 8][['country', 'invoiceno']].groupby('country').count().head()

                 invoiceno
country
Australia              107
Austria                 88
Belgium                194
Canada                   5
Channel Islands        140

#### What's the  average amount of money spent by country

In [20]:
orders[['country', 'amount_spent']].groupby('country').mean().head()

           amount_spent
country
Australia    116.895620
Austria       25.624824
Bahrain       32.258824
Belgium       20.283772
Brazil        35.737500

#### What's the most expensive item?

In [39]:
orders[orders.unitprice == orders['unitprice'].max()][['description','unitprice']]

       description  unitprice
118352     postage    8142.75

#### What was the average amount spent per year ?

In [40]:
orders[['year','amount_spent']].groupby('year').mean()

      amount_spent
year
2010     21.892733
2011     22.430074